ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="600ea876-962e-4c78-bacb-7368e2d7bd87">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ee6f4ac0-3f39-4cd9-afb6-ffaa044566fe">
    <name>ВариантКомплектации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ee6e203-13d7-45c1-a07a-3d9d0e3231bc">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f77527b-8df0-42ca-9d77-3ba0f3709b21">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="36cdefc1-23ca-4fe3-b864-94f83040a429">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a0a01907-71fe-4924-bd74-638b110a692d">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="660a4c7d-a983-455d-8258-5307371c13f8">
    <name>ЗаказНаСборку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bd635e04-353a-4d71-8660-cf3ae445ab1c">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa07f5c4-d5c2-4cb2-9433-e9565f6a27d8">
    <name>СборкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b378b97-d647-4523-9e40-499cc5cb9eee">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42eddef1-f1c0-4c28-868f-c53ff3b76c66">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b16013d8-0227-4894-95d4-41b953964e2b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18bd1d8d-c087-4f99-851a-5d41d3f0ed51">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa56f4d-953f-4b01-8a6c-014d0f16ba19">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d54a0d94-be3f-45da-8629-94310dc2c049">
    <name>СтатусУказанияСерий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4df2676e-97ad-40e1-a0f7-004b51589b67">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad47fd7e-1b44-46ea-a233-e65b10329003">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c19bc0a-7b96-4930-8c74-7f43350faf62">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01b20195-7857-404d-82be-3efae39c7c2c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b2fbcc6-82e8-4e4c-a7c8-fa5896394fca">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63a61636-717d-4a8e-a28c-c9ae80893062">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32b9a2f5-fce3-42c0-8a15-8fc15858889a">
    <name>ИТБК_Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ce36f06-f964-4753-83ea-f5b6652e1dec">
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4fa1b212-5596-4c95-a562-392b50315555">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dc6a6404-b09b-4240-846b-07c2552f4996">
    <name>ХарактеристикаОсновногоКомпонента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="85fa083b-56a3-4b85-88d5-3fae8995cdba">
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9fd7aec0-8cbd-4593-9f4e-74adcf73085e">
    <name>Исправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0addc640-6cc8-46a6-97b6-6ae4c465a4c1">
    <name>ИсправляемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58fb0f17-d48c-462a-9f54-da6fc9a3ef43">
    <name>ВидыЗапасовУказаныВручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b14b82bc-d938-49a1-a8cf-9143fbe41013">
    <name>НоменклатураОсновногоКомпонента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2d689016-6760-4f80-9b92-4c3194170afc">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e7d6af32-9bc6-40c2-b3f1-f5d16ad67df9">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="52b01363-8774-4cb2-a192-b4017c48be6b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="75714917-2443-4e00-97e3-3f32e5c1c870">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7b7faa90-f406-40f9-aae7-287a64234bf7">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="205a5d62-e0bd-4d13-ac4b-344c70e51e4e">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a25e3b0c-2647-4c12-aa53-991fe77955a6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d08b2132-bc78-45e1-bd1a-275ae1675ac9">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="131bcf48-82b5-4e46-a42a-d7ef41bc417a">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="173cb865-b4b1-4057-9b23-0a67452e9528">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1d46cbbe-be1a-4196-b458-51037d7f1552">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b8557420-3eb9-4319-b879-086b506b92c1">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="189ed9ee-bcac-4a26-bd80-eab154590830">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b96dc5d5-30ae-41e0-b0a6-946b03ec4b15">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="55930922-cabf-4c84-b3d5-63ce57042484">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e8e831b3-6592-4eb3-92e1-b1dce013fbff">
    <name>ИТБК_Доизготовить</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3d7746b0-2aa4-41e1-96f9-b95b61022d9c">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fed828ef-40d6-414e-a847-7607e068577d">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8bfbd845-f266-496c-92ea-0d7b9ab8e7e4">
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ac576dbc-4ef1-44b8-8eb2-af25f6800d5e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="782a3e5d-4083-49eb-bbc2-f173ba8cf2fd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c39fd604-cebe-43b2-a496-ef4963c54a09">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3f2b62d1-0fd7-4fbe-8a7a-08a5824895b1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b18a1074-c20d-4261-ae91-b03fe9a5a4a7">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cd40478a-aeef-47d3-9b75-8fc636b03906">
    <name>ВидыЗапасовОприходование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e4571c94-ee32-40ef-9c7c-47550399d5b1">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4b7135f7-99a3-45b7-a14d-40944b6fc047">
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="23d26675-8c40-4c0f-af88-73d5c9c12a0f">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a02a92b-aaeb-45ba-b5f0-b136bdfd8dcf">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f5486838-d74d-45ed-9dfb-ae6b42c4fbec">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="61b6d282-d8c7-49fc-bd00-4f5fc918399a">
    <name>ВидыЗапасовСписание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8c35380a-eacf-4a8d-bb24-cc57f770630d">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45943e03-de62-46a7-98c8-094c0ef2b9cf">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f01cd6fc-52d1-409b-841d-2eb1fa787416">
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f4debfc-2d15-4045-88e6-d47cf60fa8b9">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="02c4f505-4d64-4889-8bd8-65e91e2b13dd">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="63b70021-4da8-4f46-a89f-e5338f24599f">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Documents/СборкаТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИТБК_НоменклатураПриИзмененииПосле(Элемент)
	
	//Элементы.серии.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", объект.Номенклатура); 
	
КонецПроцедуры


&НаСервере
Процедура ИТБК_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	
	//Элементы.серии.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", объект.Номенклатура); 
	Элементы.ИТБК_Доизготовление.Заголовок = "# К доизготовлению (" + объект.ИТБК_Доизготовить.Количество() + ")";
	ИТБК_СтатусПриИзмененииПослеНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ИТБК_СтатусПриИзмененииПослеНаСервере()

	для Каждого стр из  Элементы.ГруппаСтраницы.ПодчиненныеЭлементы цикл
		стр.ТолькоПросмотр = объект.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_СтатусПриИзмененииПосле(Элемент)
	
	ИТБК_СтатусПриИзмененииПослеНаСервере();
	
КонецПроцедуры


&НаКлиенте
&После("ОткрытьПодборСерийЗавершение")
Процедура ИТБК_ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры)
	
	//ЗаполнитьИТБК_Серию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИТБК_Серию()
	
	//СтрокаСерии = Объект.Серии.Выгрузить().Найти(Объект.Номенклатура,"Номенклатура");
	//Если СтрокаСерии <> Неопределено тогда
	//	Объект.ИТБК_Серия = СтрокаСерии.Серия;	
	//иначе
	//	Объект.ИТБК_Серия = Объект.Серия
	//КонецЕсли;

	
КонецПроцедуры

&НаСервере
&После("УстановитьДоступностьСерииВШапке")
Процедура ИТБК_УстановитьДоступностьСерииВШапке()
	// begin fix Designer29.09.2023 10:53:56
	//Элементы.итбк_Серия.Видимость = Элементы.Серия.Видимость;
	//Элементы.Серия.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьИТБК_Серию();
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_ПриОткрытииПосле(Отказ)
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура ИТБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Количество=1;  	     // begin fix Designer29.09.2023 10:47:17
	КоличествоУпаковок=1;// end fix Designer29.09.2023 10:47:23
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_СерияПриИзмененииПосле(Элемент)
	Объект.ИТБК_Серия = Объект.Серия;
КонецПроцедуры
